Revit 2026 API

# ViewportHasViewportTransforms Method

---

Indicates if the viewport has transforms.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasViewportTransforms()
```
```vb
Public Function HasViewportTransforms As Boolean
```
```cpp
public:
bool HasViewportTransforms()
```
```fsharp
member HasViewportTransforms : unit -> bool
```

#### Return Value

Boolean True if the viewport has transforms, false otherwise.

Not all viewports have transforms. For example, viewports for schedules and legends do not have transforms.

#### Reference

Viewport Class

Autodesk.Revit.DB Namespace